ThingPulse/esp8266-weather-station/WundergroundClient.cpp
void WundergroundClient::value(String value) {
  if (currentKey == "local_epoch") {
    localEpoc = value.toInt();
    localMillisAtUpdate = millis();
  }

  // JJG added ... //////////////////////// search for keys /////////////////////////
  if (currentKey == "percentIlluminated") {
    moonPctIlum = value;
  }

  if (currentKey == "ageOfMoon") {
    moonAge = value;
  }

  if (currentKey == "phaseofMoon") {
    moonPhase = value;
  }


  if (currentParent == "sunrise") {      // Has a Parent key and 2 sub-keys
	if (currentKey == "hour") {
		int tempHour = value.toInt();    // do this to concert to 12 hour time (make it a function!)
		if (usePM && tempHour > 12){
			tempHour -= 12;
			isPM = true;
		}
		else isPM = false;
		char tempHourBuff[3] = "";						// fowlerk add for formatting, 12/22/16
		sprintf(tempHourBuff, "%2d", tempHour);			// fowlerk add for formatting, 12/22/16
		sunriseTime = String(tempHourBuff);				// fowlerk add for formatting, 12/22/16
        //sunriseTime = value;
      }
	if (currentKey == "minute") {
		char tempMinBuff[3] = "";						// fowlerk add for formatting, 12/22/16
		sprintf(tempMinBuff, "%02d", value.toInt());	// fowlerk add for formatting, 12/22/16
		sunriseTime += ":" + String(tempMinBuff);		// fowlerk add for formatting, 12/22/16
		if (isPM) sunriseTime += "pm";
		else if (usePM) sunriseTime += "am";
	}
  }


  if (currentParent == "sunset") {      // Has a Parent key and 2 sub-keys
	if (currentKey == "hour") {
		int tempHour = value.toInt();   // do this to concert to 12 hour time (make it a function!)
		if (usePM && tempHour > 12){
			tempHour -= 12;
			isPM = true;
		}
		else isPM = false;
		char tempHourBuff[3] = "";						// fowlerk add for formatting, 12/22/16
		sprintf(tempHourBuff, "%2d", tempHour);			// fowlerk add for formatting, 12/22/16
		sunsetTime = String(tempHourBuff);				// fowlerk add for formatting, 12/22/16
       // sunsetTime = value;
      }
	if (currentKey == "minute") {
		char tempMinBuff[3] = "";						// fowlerk add for formatting, 12/22/16
		sprintf(tempMinBuff, "%02d", value.toInt());	// fowlerk add for formatting, 12/22/16
		sunsetTime += ":" + String(tempMinBuff);		// fowlerk add for formatting, 12/22/16
		if (isPM) sunsetTime += "pm";
		else if(usePM) sunsetTime += "am";
    }
  }

  if (currentParent == "moonrise") {      // Has a Parent key and 2 sub-keys
	if (currentKey == "hour") {
		int tempHour = value.toInt();   // do this to concert to 12 hour time (make it a function!)
		if (usePM && tempHour > 12){
			tempHour -= 12;
			isPM = true;
		}
		else isPM = false;
		char tempHourBuff[3] = "";						// fowlerk add for formatting, 12/22/16
		sprintf(tempHourBuff, "%2d", tempHour);			// fowlerk add for formatting, 12/22/16
		moonriseTime = String(tempHourBuff);			// fowlerk add for formatting, 12/22/16
       // moonriseTime = value;
      }
	if (currentKey == "minute") {
		char tempMinBuff[3] = "";						// fowlerk add for formatting, 12/22/16
		sprintf(tempMinBuff, "%02d", value.toInt());	// fowlerk add for formatting, 12/22/16
		moonriseTime += ":" + String(tempMinBuff);		// fowlerk add for formatting, 12/22/16
		if (isPM) moonriseTime += "pm";
		else if (usePM) moonriseTime += "am";
    }
  }

  if (currentParent == "moonset") {      // Not used - has a Parent key and 2 sub-keys
	if (currentKey == "hour") {
		char tempHourBuff[3] = "";						// fowlerk add for formatting, 12/22/16
		sprintf(tempHourBuff, "%2d", value.toInt());	// fowlerk add for formatting, 12/22/16
		moonsetTime = String(tempHourBuff);				// fowlerk add for formatting, 12/22/16
    }
	if (currentKey == "minute") {
		char tempMinBuff[3] = "";						// fowlerk add for formatting, 12/22/16
		sprintf(tempMinBuff, "%02d", value.toInt());	// fowlerk add for formatting, 12/22/16
		moonsetTime += ":" + String(tempMinBuff);		// fowlerk add for formatting, 12/22/16
    }
  }

  if (currentKey == "wind_mph" && !isMetric) {
    windSpeed = value + "mph";
  }

  if (currentKey == "wind_kph" && isMetric) {
    windSpeed = value + "km/h";
  }

   if (currentKey == "wind_dir") {
    windDir = value;
  }
 
// end JJG add  ////////////////////////////////////////////////////////////////////

//Add by Viktor70
   if (currentKey == "visibility_mi" && !isMetric) {
    visibility = value;
  }
   if (currentKey == "visibility_km" && isMetric) {
    visibility = value;
  }
//End add

   if (currentKey == "local_time_rfc822") {
    date = value.substring(0, 16);
  }

  if (currentKey == "observation_time_rfc822") {
    observationDate = value.substring(0, 16);
  }
// Begin add, fowlerk...04-Dec-2016
   if (currentKey == "observation_time") {
    observationTime = value;
  }
// end add, fowlerk

  if (currentKey == "temp_f" && !isMetric) {
    currentTemp = value;
  }
  if (currentKey == "temp_c" && isMetric) {
    currentTemp = value;
  }
  if (currentKey == "icon") {
    if (isForecast && !isSimpleForecast && currentForecastPeriod < MAX_FORECAST_PERIODS) {
      #ifdef WU_DEBUG
      Serial.println(String(currentForecastPeriod) + ": " + value + ":" + currentParent);
      #endif
	  forecastIcon[currentForecastPeriod] = value;
    }
    // if (!isForecast) {													// Removed by fowlerk
    if (isCurrentObservation && !(isForecast || isSimpleForecast)) {		// Added by fowlerk
      weatherIcon = value;
    }
  }
  if (currentKey == "weather") {
    weatherText = value;
  }
  if (currentKey == "relative_humidity") {
    humidity = value;
  }
  if (currentKey == "pressure_mb" && isMetric) {
    pressure = value + "mb";
  }
  if (currentKey == "pressure_in" && !isMetric) {
    pressure = value + "in";
  }
  // fowlerk added...
  if (currentKey == "feelslike_f" && !isMetric) {
    feelslike = value;
  }

  if (currentKey == "feelslike_c" && isMetric) {
    feelslike = value;
  }

  if (currentKey == "UV") {
    UV = value;
  }

  // Active alerts...added 18-Dec-2016
  if (currentKey == "type" && isAlerts) {
	activeAlertsCnt++;
	currentAlert++;
	activeAlerts[currentAlert-1] = value;
	#ifdef WU_DEBUG
	Serial.print("Alert type processed, value:  "); Serial.println(activeAlerts[currentAlert-1]);
    #endif
	}
  if (currentKey == "description" && isAlerts && isAlertUS) {
    activeAlertsText[currentAlert-1] = value;
	#ifdef WU_DEBUG
	Serial.print("Alert description processed, value:  "); Serial.println(activeAlertsText[currentAlert-1]);
    #endif
  }
  if (currentKey == "wtype_meteoalarm_name" && isAlerts && isAlertEU) {
    activeAlertsText[currentAlert-1] = value;
	#ifdef WU_DEBUG
	Serial.print("Alert description processed, value:  "); Serial.println(activeAlertsText[currentAlert-1]);
    #endif
  }
  if (currentKey == "level_meteoalarm_name" && isAlerts && isAlertEU) {
    activeAlertsLevel[currentAlert-1] = value;
  }
  if (currentKey == "message" && isAlerts) {
    activeAlertsMessage[currentAlert-1] = value;
	#ifdef WU_DEBUG
	Serial.print("Alert msg length:  "); Serial.println(activeAlertsMessage[currentAlert-1].length());
    #endif
	if(activeAlertsMessage[currentAlert-1].length() >= 511) {
		activeAlertsMessageTrunc[currentAlert-1] = true;
	} else {
		activeAlertsMessageTrunc[currentAlert-1] = false;
	}
	#ifdef WU_DEBUG
	Serial.print("Alert message processed, value:  "); Serial.println(activeAlertsMessage[currentAlert-1]);
    #endif
  }
  if (currentKey == "date" && isAlerts) {
	activeAlertsStart[currentAlert-1] = value;
	// Check last char for a "/"; the returned value sometimes includes this; if so, strip it (47 is a "/" char)
	if (activeAlertsStart[currentAlert-1].charAt(activeAlertsStart[currentAlert-1].length()-1) == 47) {
	#ifdef WU_DEBUG
		Serial.println("...last char is a slash...");
    #endif
		activeAlertsStart[currentAlert-1] = activeAlertsStart[currentAlert-1].substring(0,(activeAlertsStart[currentAlert-1].length()-1));
	}
	// For meteoalarms, the start field is returned with the UTC=0 by default (not used?)
	if (isAlertEU && activeAlertsStart[currentAlert-1] == "1970-01-01 00:00:00 GMT") {
		activeAlertsStart[currentAlert-1] = "<Not specified>";
	}
	#ifdef WU_DEBUG
	Serial.print("Alert start processed, value:  "); Serial.println(activeAlertsStart[currentAlert-1]);
    #endif
  }
  if (currentKey == "expires" && isAlerts) {
    activeAlertsEnd[currentAlert-1] = value;
	#ifdef WU_DEBUG
	Serial.print("Alert expiration processed, value:  "); Serial.println(activeAlertsEnd[currentAlert-1]);
    #endif
  }
  if (currentKey == "phenomena" && isAlerts) {
    activeAlertsPhenomena[currentAlert-1] = value;
	#ifdef WU_DEBUG
	Serial.print("Alert phenomena processed, value:  "); Serial.println(activeAlertsPhenomena[currentAlert-1]);
    #endif
  }
  if (currentKey == "significance" && isAlerts && isAlertUS) {
    activeAlertsSignificance[currentAlert-1] = value;
	#ifdef WU_DEBUG
	Serial.print("Alert significance processed, value:  "); Serial.println(activeAlertsSignificance[currentAlert-1]);
    #endif
  }
  // Map meteoalarm level to the field for significance for consistency (used for European alerts)
  if (currentKey == "level_meteoalarm" && isAlerts && isAlertEU) {
    activeAlertsSignificance[currentAlert-1] = value;
	#ifdef WU_DEBUG
	Serial.print("Meteo alert significance processed, value:  "); Serial.println(activeAlertsSignificance[currentAlert-1]);
    #endif
  }
  // For meteoalarms only (European alerts); attribution must be displayed according to the T&C's of use
  if (currentKey == "attribution" && isAlerts) {
	activeAlertsAttribution[currentAlert-1] = value;
	// Remove some of the markup in the attribution
	activeAlertsAttribution[currentAlert-1].replace(" <a href='"," ");
	activeAlertsAttribution[currentAlert-1].replace("</a>","");
	activeAlertsAttribution[currentAlert-1].replace("/'>"," ");
  }

  // end fowlerk add

