ThingPulse/esp8266-weather-station/WundergroundClient.cpp
  if (currentKey == "dewpoint_f" && !isMetric) {
    dewPoint = value;
  }
  if (currentKey == "dewpoint_c" && isMetric) {
    dewPoint = value;
  }
  if (currentKey == "precip_today_metric" && isMetric) {
    precipitationToday = value;
  }
  if (currentKey == "precip_today_in" && !isMetric) {
    precipitationToday = value;
  }
  if (currentKey == "period") {
    currentForecastPeriod = value.toInt();
  }
// Modified below line to add check to ensure we are processing the 10-day forecast
// before setting the forecastTitle (day of week of the current forecast day).
// (The keyword title is used in both the current observation and the 10-day forecast.)
//		Modified by fowlerk
  // if (currentKey == "title" && currentForecastPeriod < MAX_FORECAST_PERIODS) {				// Removed, fowlerk
  if (currentKey == "title" && isForecast && currentForecastPeriod < MAX_FORECAST_PERIODS) {
      #ifdef WU_DEBUG
      Serial.println(String(currentForecastPeriod) + ": " + value);
      #endif
	  forecastTitle[currentForecastPeriod] = value;
  }

  // Added forecastText key following...fowlerk, 12/3/16
  if (currentKey == "fcttext" && isForecast && !isMetric && currentForecastPeriod < MAX_FORECAST_PERIODS) {
      forecastText[currentForecastPeriod] = value;
  }
  // Added option for metric forecast following...fowlerk, 12/22/16
  if (currentKey == "fcttext_metric" && isForecast && isMetric && currentForecastPeriod < MAX_FORECAST_PERIODS) {
      forecastText[currentForecastPeriod] = value;
  }
  // end fowlerk add, 12/3/16

  // Added PoP (probability of precipitation) key following...fowlerk, 12/22/16
  if (currentKey == "pop" && isForecast && currentForecastPeriod < MAX_FORECAST_PERIODS) {
      PoP[currentForecastPeriod] = value;
  }
  // end fowlerk add, 12/22/16


  //Vikt1970
  if (currentKey == "avehumidity" && currentForecastPeriod < MAX_FORECAST_PERIODS) {
	  forecastHumidity[currentForecastPeriod] = value;
  }
  if (currentKey == "mm" && isMetric && currentForecastPeriod < MAX_FORECAST_PERIODS) {

	  if (currentParent == "qpf_allday") {
        forecastRain[currentForecastPeriod] = value;
      }
   }
  if (currentKey == "cm" && isMetric && currentForecastPeriod < MAX_FORECAST_PERIODS) {

	  if (currentParent == "snow_allday") {
        forecastSnow[currentForecastPeriod] = value;
      }
   }
  if (currentKey == "in" && !isMetric && currentForecastPeriod < MAX_FORECAST_PERIODS) {

      if (currentParent == "qpf_allday") {
        forecastRain[currentForecastPeriod] = value;
      }
      else if (currentParent == "snow_allday") {
        forecastSnow[currentForecastPeriod] = value;
      }
  }
  // End Vikt 1970
  
  // The detailed forecast period has only one forecast per day with low/high for both
  // night and day, starting at index 1.
  int dailyForecastPeriod = (currentForecastPeriod - 1) * 2;

  if (currentKey == "fahrenheit" && !isMetric && dailyForecastPeriod < MAX_FORECAST_PERIODS) {

      if (currentParent == "high") {
        forecastHighTemp[dailyForecastPeriod] = value;
      }
      if (currentParent == "low") {
        forecastLowTemp[dailyForecastPeriod] = value;
      }
  }
  if (currentKey == "celsius" && isMetric && dailyForecastPeriod < MAX_FORECAST_PERIODS) {

      if (currentParent == "high") {
        #ifdef WU_DEBUG
		Serial.println(String(currentForecastPeriod)+ ": " + value);
		#endif
        forecastHighTemp[dailyForecastPeriod] = value;
      }
      if (currentParent == "low") {
        forecastLowTemp[dailyForecastPeriod] = value;
      }
  }
  // fowlerk added...to pull month/day from the forecast period
  if (currentKey == "month" && isSimpleForecast && currentForecastPeriod < MAX_FORECAST_PERIODS)  {
	//	Added by fowlerk to handle transition from txtforecast to simpleforecast, as
	//	the key "period" doesn't appear until after some of the key values needed and is
	//	used as an array index.
	if (isSimpleForecast && currentForecastPeriod == 19) {
		currentForecastPeriod = 0;
	}
	forecastMonth[currentForecastPeriod] = value;
  }

  if (currentKey == "day" && isSimpleForecast && currentForecastPeriod < MAX_FORECAST_PERIODS)  {
	//	Added by fowlerk to handle transition from txtforecast to simpleforecast, as
	//	the key "period" doesn't appear until after some of the key values needed and is
	//	used as an array index.
	if (isSimpleForecast && currentForecastPeriod == 19) {
		currentForecastPeriod = 0;
	}
	forecastDay[currentForecastPeriod] = value;
  }
  // end fowlerk add

}

void WundergroundClient::endArray() {

}


void WundergroundClient::startObject() {
  currentParent = currentKey;
}

void WundergroundClient::endObject() {
  currentParent = "";
}

void WundergroundClient::endDocument() {
 error_status=-1;
}

void WundergroundClient::startArray() {

}


String WundergroundClient::getHours() {
    if (localEpoc == 0) {
      return "--";
    }
    int hours = (getCurrentEpoch()  % 86400L) / 3600 + gmtOffset;
    if (hours < 10) {
      return "0" + String(hours);
    }
    return String(hours); // print the hour (86400 equals secs per day)

}
String WundergroundClient::getMinutes() {
    if (localEpoc == 0) {
      return "--";
    }
    int minutes = ((getCurrentEpoch() % 3600) / 60);
    if (minutes < 10 ) {
      // In the first 10 minutes of each hour, we'll want a leading '0'
      return "0" + String(minutes);
    }
    return String(minutes);
}
String WundergroundClient::getSeconds() {
    if (localEpoc == 0) {
      return "--";
    }
    int seconds = getCurrentEpoch() % 60;
    if ( seconds < 10 ) {
      // In the first 10 seconds of each minute, we'll want a leading '0'
      return "0" + String(seconds);
    }
    return String(seconds);
}
String WundergroundClient::getDate() {
  return date;
}
String WundergroundClient::getObservationDate() {
  return observationDate;
}
long WundergroundClient::getCurrentEpoch() {
  return localEpoc + ((millis() - localMillisAtUpdate) / 1000);
}

// JJG added ... /////////////////////////////////////////////////////////////////////////////////////////
String WundergroundClient::getMoonPctIlum() {
  return moonPctIlum;
}

String WundergroundClient::getMoonAge() {
  return moonAge;
}

