ThingPulse/esp8266-weather-station/WundergroundClient.cpp
String WundergroundClient::getMoonPhase() {
  return moonPhase;
}

String WundergroundClient::getSunriseTime() {
  return sunriseTime;
 }

String WundergroundClient::getSunsetTime() {
  return sunsetTime;
 }

String WundergroundClient::getMoonriseTime() {
  return moonriseTime;
 }

String WundergroundClient::getMoonsetTime() {
  return moonsetTime;
 }

String WundergroundClient::getWindSpeed() {
  return windSpeed;
 }

String WundergroundClient::getWindDir() {
  return windDir;
 }

 // end JJG add ////////////////////////////////////////////////////////////////////////////////////////////


String WundergroundClient::getCurrentTemp() {
  return currentTemp;
}

String WundergroundClient::getWeatherText() {
  return weatherText;
}

String WundergroundClient::getHumidity() {
  return humidity;
}

String WundergroundClient::getPressure() {
  return pressure;
}

String WundergroundClient::getDewPoint() {
  return dewPoint;
}
// fowlerk added...
String WundergroundClient::getFeelsLike() {
  return feelslike;
}

String WundergroundClient::getUV() {
  return UV;
}

//Add by Viktor1970
String WundergroundClient::getVisibility() {
  return visibility;
}
//End add

// Added by fowlerk, 04-Dec-2016
String WundergroundClient::getObservationTime() {
  return observationTime;
}

// Active alerts...added 18-Dec-2016
String WundergroundClient::getActiveAlerts(int alertIndex) {
  return activeAlerts[alertIndex];
}

String WundergroundClient::getActiveAlertsText(int alertIndex) {
  return activeAlertsText[alertIndex];
}

String WundergroundClient::getActiveAlertsMessage(int alertIndex) {
  return activeAlertsMessage[alertIndex];
}

String WundergroundClient::getActiveAlertsLevel(int alertIndex) {
  return activeAlertsLevel[alertIndex];
}

bool WundergroundClient::getActiveAlertsMessageTrunc(int alertIndex) {
  return activeAlertsMessageTrunc[alertIndex];
}

String WundergroundClient::getActiveAlertsStart(int alertIndex) {
  return activeAlertsStart[alertIndex];
}

String WundergroundClient::getActiveAlertsEnd(int alertIndex) {
  return activeAlertsEnd[alertIndex];
}

String WundergroundClient::getActiveAlertsPhenomena(int alertIndex) {
  return activeAlertsPhenomena[alertIndex];
}

String WundergroundClient::getActiveAlertsSignificance(int alertIndex) {
  return activeAlertsSignificance[alertIndex];
}

String WundergroundClient::getActiveAlertsAttribution(int alertIndex) {
  return activeAlertsAttribution[alertIndex];
}

int WundergroundClient::getActiveAlertsCnt() {
  return activeAlertsCnt;
}

// end fowlerk add


String WundergroundClient::getPrecipitationToday() {
  return precipitationToday;
}

String WundergroundClient::getTodayIcon() {
  return weatherIcon;
}

String WundergroundClient::getForecastIcon(int period) {
  return forecastIcon[period];
}

String WundergroundClient::getForecastTitle(int period) {
  return forecastTitle[period];
}

String WundergroundClient::getForecastHumidity(int period) {
  return forecastHumidity[period];
}
String WundergroundClient::getForecastRain(int period) {
  return forecastRain[period];
}
String WundergroundClient::getForecastSnow(int period) {
  return forecastSnow[period];
}

String WundergroundClient::getForecastLowTemp(int period) {
  return forecastLowTemp[period];
}

String WundergroundClient::getForecastHighTemp(int period) {
  return forecastHighTemp[period];
}
// fowlerk added...
String WundergroundClient::getForecastDay(int period) {
//  Serial.print("Day period:  "); Serial.println(period);
  return forecastDay[period];
}

String WundergroundClient::getForecastMonth(int period) {
//  Serial.print("Month period:  "); Serial.println(period);
  return forecastMonth[period];
}

String WundergroundClient::getForecastText(int period) {
//  Serial.print("Forecast period:  "); Serial.println(period);
  return forecastText[period];
}

// Added PoP...12/22/16
String WundergroundClient::getPoP(int period) {
  return PoP[period];
}
// end fowlerk add


String WundergroundClient::getMeteoconIcon(String iconText) {
  if (iconText == "chanceflurries") return "F";
  if (iconText == "chancerain") return "Q";
  if (iconText == "chancesleet") return "W";
  if (iconText == "chancesnow") return "V";
  if (iconText == "chancetstorms") return "S";
  if (iconText == "clear") return "B";
  if (iconText == "cloudy") return "Y";
  if (iconText == "flurries") return "F";
  if (iconText == "fog") return "M";
  if (iconText == "hazy") return "E";
  if (iconText == "mostlycloudy") return "Y";
  if (iconText == "mostlysunny") return "H";
  if (iconText == "partlycloudy") return "H";
  if (iconText == "partlysunny") return "J";
  if (iconText == "sleet") return "W";
  if (iconText == "rain") return "R";
  if (iconText == "snow") return "W";
  if (iconText == "sunny") return "B";
  if (iconText == "tstorms") return "0";

  if (iconText == "nt_chanceflurries") return "F";
  if (iconText == "nt_chancerain") return "7";
  if (iconText == "nt_chancesleet") return "#";
  if (iconText == "nt_chancesnow") return "#";
  if (iconText == "nt_chancetstorms") return "&";
  if (iconText == "nt_clear") return "2";
  if (iconText == "nt_cloudy") return "Y";
  if (iconText == "nt_flurries") return "9";
  if (iconText == "nt_fog") return "M";
  if (iconText == "nt_hazy") return "E";
  if (iconText == "nt_mostlycloudy") return "5";
  if (iconText == "nt_mostlysunny") return "3";
  if (iconText == "nt_partlycloudy") return "4";
  if (iconText == "nt_partlysunny") return "4";
  if (iconText == "nt_sleet") return "9";
  if (iconText == "nt_rain") return "7";
  if (iconText == "nt_snow") return "#";
  if (iconText == "nt_sunny") return "4";
  if (iconText == "nt_tstorms") return "&";

  return ")";
}
